artillery/test.yml
config:
  target: "http://httpbin.org/"
  environment:
    stress:
      phases:
      - duration: 10
        arrivalRate: 10
        name: Artillery First Test
    endurance:
      phases:
      - duration: 20
        arrivalRate: 2
        name: Artillery Second Test
    payload:
      path: "keywords.csv"
      fields: ["fruit", "car"]
      order: sequence
      skipHeader: false
      cast: false
      skipEmptytLines: true
    plugins:
      ensure:
        thresholds:
          - http.response_time.p95: 10
          - http.response_time.max: 5000
        conditions:
          - expression: vusers.failed == 0
          - expression: "http.request_rate >= 2 and http.response_time.max < 600"
scenarios:
  - name: "Get Request"
    flow:
      - get:
          url: "{{ target }}get"
      - post:
          url: "{{ target }}post"
          json:
            username: "Test User"
            password: "Temp Password"
          capture:
          - json: "$.json"
            as: "request_body"
          - json: "$.headers.Host"
            as: "host"
      # - log: "Json value from response is: {{ request_body}}"
      # - log: "Host value from response is {{ host}}"
      - think: 1
      # - assert:
      #   - json: "$.args"
      #     condition: "exists"
      #   - json: "$.headers.Content-Length"
      #     condition: "<10"